Winterviking/code_examples/uartled/INCLUDE/MDR1986VE1T_helper.h

#ifndef __MDR1986VE1T_HELPER_H_INCLUDED__
#define __MDR1986VE1T_HELPER_H_INCLUDED__

//
// Port pins' numbers
//

#define PORT_PIN_NUMBER_00      0x0
#define PORT_PIN_NUMBER_01      0x1
#define PORT_PIN_NUMBER_02      0x2
#define PORT_PIN_NUMBER_03      0x3
#define PORT_PIN_NUMBER_04      0x4
#define PORT_PIN_NUMBER_05      0x5
#define PORT_PIN_NUMBER_06      0x6
#define PORT_PIN_NUMBER_07      0x7
#define PORT_PIN_NUMBER_08      0x8
#define PORT_PIN_NUMBER_09      0x9
#define PORT_PIN_NUMBER_10      0xA
#define PORT_PIN_NUMBER_11      0xB
#define PORT_PIN_NUMBER_12      0xC
#define PORT_PIN_NUMBER_13      0xD
#define PORT_PIN_NUMBER_14      0xE
#define PORT_PIN_NUMBER_15      0xF

#define PORT_PIN_MASK_00        0x0001
#define PORT_PIN_MASK_01        0x0002
#define PORT_PIN_MASK_02        0x0004
#define PORT_PIN_MASK_03        0x0008
#define PORT_PIN_MASK_04        0x0010
#define PORT_PIN_MASK_05        0x0020
#define PORT_PIN_MASK_06        0x0040
#define PORT_PIN_MASK_07        0x0080
#define PORT_PIN_MASK_08        0x0100
#define PORT_PIN_MASK_09        0x0200
#define PORT_PIN_MASK_10        0x0400
#define PORT_PIN_MASK_11        0x0800
#define PORT_PIN_MASK_12        0x1000
#define PORT_PIN_MASK_13        0x2000
#define PORT_PIN_MASK_14        0x4000
#define PORT_PIN_MASK_15        0x8000


#endif // End of __MDR1986VE1T_HELPER_H_INCLUDED__

